{
    "intro": [ 
        {
            "id": 1,
            "dialogue": "Flowers? Check. Those cheesy heart shaped boxes filled with chocolates you see in every romance movie? Check. Looks like I've got everything for my date with Vanessa.",
            "teller": "My mind"
        },

        {
            "id": 2,
            "dialogue": "I still have no idea how I banked the hottest chick in class, but I'm not complaining. Her long hair, her beautiful eyes and her very big, firm  and well rounded...",
            "teller": "My mind"
        },

        {
            "id": 3,
            "dialogue": "Personality.",
            "teller": "My mind"
        },

        {
            "id": 4,
            "dialogue": "To think she is waiting in the park for me just up ahead. Man am I nervous. I've been crushing on her ever since the start of the year.",
            "teller": "My mind"
        },

        {
            "id": 5,
            "dialogue": "I absolutely, without a doubt, can't afford to screw this up. I need her to think I'm cool and laid back. Not some stinky basement dweller playing games all day.",
            "teller": "My mind"
        },

        {
            "id": 6,
            "dialogue": "I mean, I am, but she doesn't know that yet so I might actually have a chance.",
            "teller": "My mind"
        },

        {
            "id": 7,
            "dialogue": "Alright, just gotta check the time and- OH NO I AM RUNNING LATE!",
            "teller": "My mind"
        },

        {
            "id": 8,
            "dialogue": "Oh man I'm running late! I guess internally monologing does take up a lot of time. I better get going and fast!",
            "teller": "My mind"
        },

        {
            "id": 9,
            "dialogue": "I just have to walk up these stairs",
            "teller": "My mind"
        },
        {
            "id": 9.5,
            "dialogue": "Press UP to walk up the stairs, press DOWN to go home like a loser",
            "teller": ""
        },

        {
            "id": 10,
            "dialogue": "It will be a breeze, just a few more steps and-",
            "teller": "My mind"
        },

        {
            "id": 11,
            "dialogue": "Oh no, I misstepped and I can't reach the railing! Man this is going to hurt!",
            "teller": "My mind"
        },

        {
            "id": 12,
            "dialogue": "...",
            "teller": "My mind"
        },

        {
          "id": 13,
          "dialogue": "Ah man my head feels like it's about to burst. I can barely stand up.",
          "teller": "My mind"
        },
  
        {
          "id": 14,
          "dialogue": "...",
          "teller": "My mind"
        },
  
        {
          "id": 15,
          "dialogue": "Hold up a second. Where am I? This doesn't look anything like the park. What happened? I was walking up the stairs a minute ago!",
          "teller": "My mind"
        },
  
        {
          "id": 16,
          "dialogue": "Okay lets recap. I fell down the stairs, blacked out, woke up and now I'm here. There is only 1 logical explanation.",
          "teller": "My mind"
        },
  
        {
          "id": 17,
          "dialogue": "Alien. Abduction.",
          "teller": "My mind"
        },
  
        {
          "id": 18,
          "dialogue": "They made me trip, picked me up in their spaceship, harvested my organs and dropped me back here.",
          "teller": "My mind"
        },
  
        {
          "id": 19,
          "dialogue": "Wait, no. I still have my organs. But how did I get here? It doesn't feel like I was out for long.",
          "teller": "My mind"
        },
  
        {
          "id": 20,
          "dialogue": "Hello there, little fellow.",
          "teller": "???"
        },
  
        {
          "id": 21,
          "dialogue": "A bird? A speaking bird? Since when can birds speak?",
          "teller": "Me"
        },
  
        {
          "id": 22,
          "dialogue": "My my, such an odd creature! I've never seen anyone like you before?",
          "teller": "???"
        },

        {
          "id": 23,
          "dialogue": "What are you?",
          "teller": "Me"
        },

        {
            "id": 24,
            "dialogue": "I think it's better if you ask me WHO I am. The name's Corvo. I brought you here to fulfill your destiny!",
            "teller": "Corvo"
        },

        {
            "id": 25,
            "dialogue": "What destiny? My destiny was to have a date with my smoking hot date! ",
            "teller": "Me"
        },

        {
            "id": 26,
            "dialogue": "Do you really think Vanessa would have wanted to go out with such a sad little loser like you? You've got no dating experience!",
            "teller": "Corvo"
        },

        {
            "id": 27,
            "dialogue": "Fwie fwie fwie fwie! Don't make me laugh! But not to fear because I am here! I will guide you and make sure you ace your dates in no time!",
            "teller": "Corvo"
        },

        {
            "id": 28,
            "dialogue": "What? What dates? I just want to go on my date with Vanessa!",
            "teller": "Me"
        },

        {
            "id": 29,
            "dialogue": "You see, this area is filled with cute bachelors and bachelorettes looking for love. You should practice romancing them.",
            "teller": "Corvo"
        },

        {
            "id": 30,
            "dialogue": "If you do that succesfully, you might have a shot with Vanessa. Fwie fwie fwie!",
            "teller": "Corvo"
        },

        {
            "id": 31,
            "dialogue": "How do I do that?",
            "teller": "Me"
        },

        {
            "id": 32,
            "dialogue": "Talk to them, my little fellow, make yourself out to be interesting, give them compliments to increase their love meter.",
            "teller": "Corvo"
        },

        {
            "id": 33,
            "dialogue": "Be warned though, answering questions wrong will make the lovemeter go down.",
            "teller": "Corvo"
        },

        {
            "id": 34,
            "dialogue": "I think it's time to send you out to the wild now, you can do it little fellow. Or not. fwie fwie fwie.",
            "teller": "My mind"
        },

        {
            "id": 35,
            "dialogue": "Regardless, I'll help you if you mess up.",
            "teller": "My mind"
        },

        {
            "id": 36,
            "dialogue": "There are two paths you can choose. You can choose to go towards the city or you can go to the pond in the park.",
            "teller": "Corvo"
        },

        {
            "id": 37,
            "dialogue": "Don't worry, in both area's are hotties who are single and ready to mingle.",
            "teller": "Corvo"
        },

        {
            "id": 38,
            "dialogue": "Press W to go to the city. Press S to go to the pond.",
            "teller": "Corvo"
        }
      ],
      "badoption":[
        {
            "id": 1,
            "dialogue": "Ah forget it. I'd rather be with my waifus. Hatsune Miku i'm coming home baby~!",
            "teller": "My mind"
        },
        {
            "id": 2,
            "dialogue": "You go home to make out with your body pillow-- seriously what is wrong with you\n[Press DOWN to take the L]",
            "teller": ""
        }
      ]
  }
        