
{
    "intro": [
      {
        "id": 1,
        "dialogue": "Yesterday was certainly an interesting encounter. I feel kind of bad for Aaliyah, though. Being stuck in a small lake in the middle of a park probably gets lonely. Not to mention the lack of privacy.",
        "teller": "My mind"
      },
      {
        "id": 2,
        "dialogue": "I've decided I'm going to visit her again. She seemed desperate for social interaction, and if talking to her makes her happier, I'll talk to her. ",
        "teller": "My mind"
      },
      {
        "id": 3,
        "dialogue": "I'd hate to be in her situation; the lack of privacy would eat me alive.",
        "teller": "My mind"
      },
      {
        "id": 4,
        "dialogue": "I've been thinking about where to bring her. If she can't leave this park, then her options are limited. I might be able to somehow carry her to a nice spot in the park.",
        "teller": "My mind"
      },
      {
        "id": 5,
        "dialogue": "It could be good for her to enjoy something other than that small lake.",
        "teller": "My mind"
      },
      {
        "id": 6,
        "dialogue": "Hey love! Such a surprise to see you here! A happy surprise, though.",
        "teller": "Aaliyah"
      },
      {
        "id": 7,
        "dialogue": "Yeah, I know. I kept thinking about how lonely you must be staying in that water all the time.",
        "teller": "Me"
      },
      {
        "id": 8,
        "dialogue": "And what's supposed to be wrong about staying in the place that keeps me alive?",
        "teller": "Aaliyah"
      },
      {
        "id": 9,
        "dialogue": "Nothing, but I thought you might not get out often, so I wanted to ask you out on a date in the park.",
        "teller": "Me"
      },
      {
        "id": 10,
        "dialogue": "Oh sweetie, that's adorable of you. The thing is, by the time we found a good spot, I'd have to be returning already, or else I'll dry out.",
        "teller": "Aaliyah"
      },
      {
        "id": 11,
        "dialogue": "My tentacles have to be wet, and every time I walk, some of that wetness sticks to the ground. That's why I can't go long distances.",
        "teller": "Aaliyah"
      },
      {
        "id": 12,
        "dialogue": "What if I carry you?",
        "teller": "Me"
      },
      {
        "id": 13,
        "dialogue": "What do you mean?",
        "teller": "Aaliyah"
      },
      {
        "id": 14,
        "dialogue": "Would you be able to have a small date in the park with me if I carried you there so you don't lose too much water by walking there yourself?",
        "teller": "Me"
      },
      {
        "id": 15,
        "dialogue": "I think that might be possible! Are you sure though? I don't want to break your back.",
        "teller": "Aaliyah"
      },
      {
        "id": 16,
        "dialogue": "Alright, I'll climb on top of you. Hang on!",
        "teller": "Aaliyah"
      },
      {
        "id": 17,
        "dialogue": "Will you make vehicle noises while carrying Aaliyah on your back?",
        "teller": ""
      }
      ,
      {
        "id": 18,
        "dialogue": "Press W for no.\nPress S to make funny train and car noises.",
        "teller": ""
      }
    ],
    

    "angry": [
      {
        "id": 1,
        "dialogue": "Alright, let's go!",
        "teller": "Me"
      },
      {
        "id": 2,
        "dialogue": "Wow, you sure are the life of the party. Here, try that again with W",
        "teller": "Corvo (in spirit)"
      }
    ],
    
    "happy": [
      {
        "id": 1,
        "dialogue": "Vroom! Vroooom! Eeeeeek! Beep-beep! Skreeee! Clunk! Swish-swish! Pop-pop! Beep-beep!",
        "teller": "Me"
      },
      {
        "id": 2,
        "dialogue": "What are you doing?",
        "teller": "Aaliyah"
      },
      {
        "id": 3,
        "dialogue": "I'm making car noises! I'm a human vehicle",
        "teller": "Me"
      },
      {
        "id": 4,
        "dialogue": "You're adorable! Go my little wagon, go!",
        "teller": "Aaliyah"
      },
      {
        "id": 5,
        "dialogue": "I can't go any faster!",
        "teller": "Me"
      },
      {
        "id": 6,
        "dialogue": "You better go faster or I'll treat you like a horse and slap your butt to go faster!",
        "teller": "Aaliyah"
      },
      {
        "id": 7,
        "dialogue": "Well this is conflicting- I mean yes ma'am",
        "teller": "Me"
      }
    ]
  }
  