
{
    "intro": [
      {
        "id": 1,
        "dialogue": "The pond is way closer than that city. Definitely a no-brainer to go there first.",
        "teller": "My mind"
      },
      {
        "id": 2,
        "dialogue": "And to be honest, the park is kinda nice. Nothing like it would be normally, but nice.",
        "teller": "My mind"
      },
      {
        "id": 3,
        "dialogue": "The park seems ten times bigger than normal. In the real world, it's just a small vertical park on top of some roofs of a building.",
        "teller": "My mind"
      },
      {
        "id": 4,
        "dialogue": "Here, it's huge! There are flowers and bushes everywhere. The park is a lot broader and there seems to be a lake with a fountain up ahead.",
        "teller": "My mind"
      },
      {
        "id": 5,
        "dialogue": "It seems like a perfect place to sit, calm down and think about what happened.",
        "teller": "My mind"
      },
      {
        "id": 6,
        "dialogue": "Oh, there is already someone at the fountain. They have very lushes purple hair and, tentacles?!",
        "teller": "My mind"
      },
      {
        "id": 7,
        "dialogue": "Hu hu hu hu! Hello there love, you seem quite puzzled, is something wrong?",
        "teller": "???"
      },
      {
        "id": 8,
        "dialogue": "You...have tentacles...",
        "teller": "Me"
      },
      {
        "id": 9,
        "dialogue": "My my, straight to the point I see. Well, you aren't wrong. I'm half octopus after all.",
        "teller": "???"
      },
      {
        "id": 10,
        "dialogue": "How. How does that even happen?",
        "teller": "Me"
      },
      {
        "id": 11,
        "dialogue": "Well, you see, when a mommy octopus and a daddy octopus love each other very much...",
        "teller": "???"
      },
      {
        "id": 12,
        "dialogue": "And I thought this whole situation couldn't get any weirder.",
        "teller": "Me"
      },
      {
        "id": 13,
        "dialogue": "I'm just messing with you, love. Hu hu hu hu.",
        "teller": "???"
      },
      {
        "id": 14,
        "dialogue": "I haven't seen you around here love, do you come from far away or something?",
        "teller": "???"
      },
      {
        "id": 15,
        "dialogue": "I guess you could say that...",
        "teller": "Me"
      },
      {
        "id": 16,
        "dialogue": "Well, seems like I've lucked out on the hottie I found today. You're so, otherworldly and intriguing.",
        "teller": "???"
      },
      {
        "id": 17,
        "dialogue": "I want you to go out on a date with me.",
        "teller": "???"
      },
      {
        "id": 18,
        "dialogue": "Wha-what do you mean?",
        "teller": "Me"
      },
      {
        "id": 19,
        "dialogue": "I've never seen anyone like you before. Your uniqueness attracts me.",
        "teller": "???"
      },
      {
        "id": 20,
        "dialogue": "There is something about you I can't put my finger on and it makes me want to know everything about you.",
        "teller": "???"
      },
      {
        "id": 21,
        "dialogue": "So go out on a date with me. My treat!",
        "teller": "???"
      }
    ]
  }
  